{
  "id": 481,
  "name": "Namor",
  "powerstats": {
    "intelligence": 69,
    "strength": 95,
    "speed": 58,
    "durability": 70,
    "power": 73,
    "combat": 85
  },
  "biography": {
    "fullName": "Namor McKenzie",
    "alterEgos": "No alter egos found.",
    "aliases": [
      "Imperius Rex",
      "Dr. G.W. Falton",
      "Sub-Mariner",
      "\"Subby\"",
      "Namor the First",
      "Avenging Son",
      "Old Man",
      "Rex",
      "Joe Pierre",
      "Lord of the Seven Seas",
      "the Scion of the Deep",
      "Phoenix"
    ],
    "placeOfBirth": "Atlantis",
    "firstAppearance": "Motion Picture Funnies Weekly #1 (April, 1939)",
    "publisher": "Marvel Comics",
    "alignment": "good"
  },
  "appearance": {
    "gender": "Male",
    "race": "Atlantean",
    "height": [
      "6'2",
      "188 cm"
    ],
    "weight": [
      "278 lb",
      "125 kg"
    ],
    "eyeColor": "Grey",
    "hairColor": "Black"
  },
  "work": {
    "occupation": "King of Atlantis, Adventurer; former warrior, commando, CEO",
    "base": "Ultimate Universe; formerly New Atlantis, Utopia, San Francisco Bay, California; Atlantis; Necropolis, Wakanda; occasionally mobile"
  },
  "connections": {
    "groupAffiliation": "Cabal (founder), Invaders, Atlantis; formerly Illuminati, X-Men, Extinction Team, Phoenix Five, Defenders, Osborn's X-Men, Osborn's Cabal, Avengers, All-Winners Squad, Titans Three, Fantastic Four, Oracle Inc., Order, Deep Six (founder and leader); ally o",
    "relatives": "Elanna (maternal ancestor), Tanas (maternal ancestor), Zartra (maternal ancestor), Orrek (maternal distant relative), Stegor (maternal ancestor), Kamuu (maternal ancestor), Harran (maternal ancestor), Kalen (maternal ancestor), Ossem (maternal ancestor), Balaal (maternal ancestor), Thallo (maternal ancestor), Immanu (maternal great-grandfather-in-law, deceased), Thakorr (maternal grandfather, deceased), Korra (maternal grandmother), Wa-Korr (grandfather-in-law, presumed deceased), Wathan (father-in-law, presumed deceased), Tom Smallwood (father-in-law), Gladys Smallwood (mother-in-law), Zarina (maternal aunt), Namora's father (uncle), Daka (maternal uncle), Brynn (aunt-by-marriage/step-grandmother), Fen (mother, deceased), Leonard McKenzie (father, deceased), Experiment N2 (clone), Lawrence McKenzie (paternal half-brother), Dorma (wife / distant cousin, deceased), Marrina (wife), three unnamed children (by Marrina), Kamar (son, deceased), Black Moray (Leon McKenzie) (paternal half-nephew), Llyron McKenzie (paternal great-nephew), Dan Smallwood (brother-in-law), Namora (maternal cousin), Beemer (maternal cousin), Bobo (maternal cousin), Byrrahna (maternal cousin), Namita (maternal cousin), Daro (maternal cousin), Dara (maternal cousin), Seth (maternal cousin), Argus (maternal cousin), Arkus (maternal cousin), Byrrah (maternal cousin), Namorita (maternal 1st cousin once removed)."
  },
  "image": {
    "url": "https://akabab.github.io/superhero-api/api/images/sm/namor.jpg"
  }
}